Revit 2026 API

# MEPCurveMEPSystem Property

---

The system of the MEP curve.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public MEPSystem MEPSystem { get; }
```
```vb
Public ReadOnly Property MEPSystem As MEPSystem
	Get
```
```cpp
public:
property MEPSystem^ MEPSystem {
	MEPSystem^ get ();
}
```
```fsharp
member MEPSystem : MEPSystem with get
```

#### Property Value

MEPSystem

Returns the system of this MEP curve. If the curve does not belong to any systems, the value will be . If the curve belongs to more than one system, the first available value is returned.

#### Reference

MEPCurve Class

Autodesk.Revit.DB Namespace